"""
Python 3.10 программа решения заданий курса stepik программирование на Python
Название файла 2.py

Version: 0.1
Author: Andrej Marinchenko
Date: 2022-11-29
"""

'''
Выполните код в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления. 
Постарайтесь разобраться, почему интерпретатор выдал именно такой ответ. 
Помните, что любые арифметические операции выше по приоритету операций сравнения и логических операторов.

Помните, что в Python логические значения пишутся с большой буквы: True, False.


x = 5
y = 10
y > x * x or y >= 2 * x and x < y
'''

x = 5
y = 10
print((y > (x * x)) or (y >= (2 * x)) and (x < y))
# Ответ:
# True
