"""
Python 3.10 программа решения заданий курса stepik программирование на Python
Название файла 2.py

Version: 0.1
Author: Andrej Marinchenko
Date: 2022-11-29
"""


'''
Составьте выражение для вычисления указанной ниже формулы и вставьте в поле ответа вывод интерпретатора после вычисления этого выражения.
42/(4+2*(-2))
 

На самом деле, Python 3 не может вычислить подобное выражение, поэтому возникнет ошибка.
Впишите вывод интерпретатора Python 3 в поле для ответа.
'''
x = 42/(4+2*(-2))
print(x)

# Ответ:
# ZeroDivisionError: division by zero
